
/****************************************************************************
*
*文件名：DSP28_Gpio.c
*
*功  能：2812通用输入输出口GPIO的初始化函数
*
*作  者: likyo from hellodsp
*
****************************************************************************/

#include "DSP28_Device.h"

/****************************************************************************
*
*名    称：InitGpio()
*
*功    能：初始化Gpio，使得Gpio的引脚处于已知的状态，例如确定其功能是特定功能
*          还是通用I/O。如果是通用I/O，是输入还是输出，等等。
*
*入口参数：无
*
*出口参数：无
*
****************************************************************************/

void InitGpio(void) {

    EALLOW;

    // 将GPIO中和PWM相关的引脚设置为PWM功能
    GpioMuxRegs.GPAMUX.bit.PWM1_GPIOA0 = 1;     //设置PWM1引脚
    GpioMuxRegs.GPAMUX.bit.PWM2_GPIOA1 = 1;     //设置PWM2引脚

    GpioMuxRegs.GPAMUX.bit.PWM3_GPIOA2 = 1;     //设置PWM3引脚
    GpioMuxRegs.GPAMUX.bit.PWM4_GPIOA3 = 1;     //设置PWM4引脚

    GpioMuxRegs.GPAMUX.bit.PWM5_GPIOA4 = 1;     //设置PWM5引脚
    GpioMuxRegs.GPAMUX.bit.PWM6_GPIOA5 = 1;     //设置PWM6引脚

    EDIS;
}

//===========================================================================
// No more.
//===========================================================================
