/****************************************************************************
*
*文件名：DSP28_GlobalVariable.h
*
*功  能：工程中用到的全局变量声明文件
*
*作  者: HELLODSP
*
****************************************************************************/

extern Uint32 N; //调制比
extern float M;  //调制度

//预存A相和B相的正弦值列表，C相的可以根据A相和B相的值计算出来
extern float sina[30];
extern float sinb[30];

extern Uint32 i; 




//===========================================================================
// No more.
//===========================================================================
