/****************************************************************************
*
*功  能：产生三相SPWM波形
*
*说  明：EVA下面的通用定时器T1工作于连续增/减计数模式，产生三角载波，载波频率为10kHz/1kHz可调。
*	 载波频率调节方法——在DSP28_Ev.c文件中按照需要注释38行或39行程序，确定1k或10k的载波频率，并在DSP28_DefaultIsr.c文件中的439-445行中的常数改为1000（载波频率1k）或10000（载波频率10k）。
*   调制度可调，初始值0.8，改变方法，在watch window中更改变量“M”，也即正弦波幅值。
*   调制波频率可调，初始值50Hz，改变方法，在watch window中更改变量“frequency”。
*   死区时间可调，初始值为4.27us，改变方法，在watch window中更改变量“death_time”，范围是1到15，死区时间为0.427us*death_time。
*
*

****************************************************************************/


#include "DSP28_Device.h"
#include "DSP28_Globalprototypes.h"


Uint32 N=60; //载波比
float M=0.8;  //调制度，也是正弦波幅值
Uint32 i;
Uint32 p,q,death_time;
//预存A相和B相的正弦值列表，C相的可以根据A相和B相的值计算出来
float sina[30]={ 0.000000,    0.104528,    0.207911,    0.309016,    0.406737,
                 0.500000,    0.587785,    0.669131,    0.743145,    0.809017,
		         0.866025,    0.913545,    0.951057,    0.978148,    0.994522,
		         1.000000,    0.994522,    0.978148,    0.951057,    0.913545,
		         0.866025,    0.809017,    0.743145,    0.669131,    0.587785,
		         0.500000,    0.406737,    0.309016,    0.207911,    0.104528};

float sinb[30]={ 0.866025,    0.809017,    0.743145,    0.669131,    0.587785,
                 0.500000,    0.406737,    0.309016,    0.207911,    0.104528,
		         0.000000,   -0.104528,   -0.207911,   -0.309016,   -0.406737,
		        -0.500000,   -0.587785,   -0.669131,   -0.743145,   -0.809017,
		        -0.866025,   -0.913545,   -0.951057,   -0.978148,   -0.994522,
		        -1.000000,   -0.994522,   -0.978148,   -0.951057,   -0.913545};//这张常数表用于同步调制时使用，此次试验用不到该表

/****************************************************************************
*
*名    称：main()
*
*功    能：初始化系统和各个外设
*
*入口参数：无
*
*出口参数：无
*
****************************************************************************/

void main(void)
{
    
	InitSysCtrl();  //初始化系统函数

	DINT;
	IER = 0x0000;   //禁止CPU中断
	IFR = 0x0000;   //清除CPU中断标志
	
	InitPieCtrl(); 	 //初始化PIE控制寄存器

	InitPieVectTable();  //初始化PIE中断向量表	 
	
    EALLOW;	// This is needed to write to EALLOW protected registers
    PieVectTable.ADCINT=&ADCINT_ISR;
    EDIS;   // This is needed to disable write to EALLOW protected registers
    
	InitGpio();  //初始化Gpio口，选择PWM1~6功能口

    InitEv();  //初始化EV，时间管理器，管理PWM，此次实验的核心内容

	i=1;//计数，sin(wt)中，t=i*T，T为载波周期

	PieCtrl.PIEIER2.bit.INTx4=1;      //使能PIE中断，T1定时器中断位于INT2.4

    IER|=M_INT2;

	InitAdc();
	IER|=M_INT1;

	EINT;  //开全局中断
	ERTM;  //开实时中断
	
	EvaRegs.T1CON.bit.TENABLE=1;      //使能定时器T1计数操作

	death_time=10;//1-15，初始值为10，对应死区时间为4.27us。
    while(AdcRegs.ADC_ST_FLAG.bit.SEQ1_BSY==0){
        AdcRegs.ADCTRL2.bit.SOC_SEQ1=1;
    }
    while(1)
	{    
    	  EvaRegs.DBTCONA.bit.DBT=death_time;       //死区定时器周期
    }
	
} 	
